export default function () {
  return {
    /* BlogPost -> Header */
    header: {
      title: "المدونة",
      breadCrumb: [
        { name: "الرئيسية", icon: "home", link: "Home" },
        { name: "المدونة", icon: "rss_feed", link: "Blog" },
        { name: "اسم البوست", icon: "feed" },
      ],
      activeLinkColor: "green-13",
    },

    /* BlogPost -> Post */
    post: {
      title: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة",
      time: "03:45 م",
      date: "13, اغسطس 2021",
      img: "images/home/blog/post1.jpg",
      description: `هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.<br/><br/> ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.<br/><br/> ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.<br/><br/> ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.`,
    },

    /* BlogPost -> Categories */
    categories: [
      { name: "رسم", count: "32" },
      { name: "برمجة", count: "38" },
      { name: "تصميم", count: "14" },
      { name: "سياسة", count: "77" },
      { name: "اقتصاد", count: "53" },
      { name: "تاريخ", count: "64" },
    ],

    /* BlogPost -> Tags */
    tags: ["رسم", "برمجة", "تصميم"],

    /* BlogPost -> Related Posts */
    relatedPosts: [
      {
        img: "images/home/blog/post1.jpg",
        time: "03:45 م",
        date: "13, اغسطس 2021",
        title: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة",
        description: `هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد`,
        link: "BlogPost",
      },
      {
        img: "images/home/blog/post2.webp",
        time: "03:45 م",
        date: "13, اغسطس 2021",
        title: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة",
        description: `هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد`,
        link: "BlogPost",
      },
      {
        img: "images/home/blog/post3.jpg",
        time: "03:45 م",
        date: "13, اغسطس 2021",
        title: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة",
        description: `هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد`,
        link: "BlogPost",
      },
    ],
  };
}
